ciaa/firmware_v1/externals/drivers/msp430/inc/msp430f5659.h
#define DMA0TSEL__DMA_REQ    (0x0000)  /* DMA channel 0 transfer select 0:  DMA_REQ (sw) */
#define DMA0TSEL__TA0CCR0    (0x0001)  /* DMA channel 0 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA0TSEL__TA0CCR2    (0x0002)  /* DMA channel 0 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA0TSEL__TA1CCR0    (0x0003)  /* DMA channel 0 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA0TSEL__TA1CCR2    (0x0004)  /* DMA channel 0 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA0TSEL__TA2CCR0    (0x0005)  /* DMA channel 0 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA0TSEL__TA2CCR2    (0x0006)  /* DMA channel 0 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA0TSEL__TB0CCR0    (0x0007)  /* DMA channel 0 transfer select 7:  TimerB0  (TB0CCR0.IFG) */
#define DMA0TSEL__TB0CCR2    (0x0008)  /* DMA channel 0 transfer select 8:  TimerB0  (TB0CCR2.IFG) */
#define DMA0TSEL__RES9       (0x0009)  /* DMA channel 0 transfer select 9:  Reserved */
#define DMA0TSEL__RES10      (0x000A) /* DMA channel 0 transfer select 10: Reserved */
#define DMA0TSEL__RES11      (0x000B) /* DMA channel 0 transfer select 11: Reserved */
#define DMA0TSEL__USCIA2RX   (0x000C) /* DMA channel 0 transfer select 12: USCIA2 receive */
#define DMA0TSEL__USCIA2TX   (0x000D) /* DMA channel 0 transfer select 13: USCIA2 transmit */
#define DMA0TSEL__USCIB2RX   (0x000E) /* DMA channel 0 transfer select 14: USCIB2 receive */
#define DMA0TSEL__USCIB2TX   (0x000F) /* DMA channel 0 transfer select 15: USCIB2 transmit */
#define DMA0TSEL__USCIA0RX   (0x0010) /* DMA channel 0 transfer select 16: USCIA0 receive */
#define DMA0TSEL__USCIA0TX   (0x0011) /* DMA channel 0 transfer select 17: USCIA0 transmit */
#define DMA0TSEL__USCIB0RX   (0x0012) /* DMA channel 0 transfer select 18: USCIB0 receive */
#define DMA0TSEL__USCIB0TX   (0x0013) /* DMA channel 0 transfer select 19: USCIB0 transmit */
#define DMA0TSEL__USCIA1RX   (0x0014) /* DMA channel 0 transfer select 20: USCIA1 receive */
#define DMA0TSEL__USCIA1TX   (0x0015) /* DMA channel 0 transfer select 21: USCIA1 transmit */
#define DMA0TSEL__USCIB1RX   (0x0016) /* DMA channel 0 transfer select 22: USCIB1 receive */
#define DMA0TSEL__USCIB1TX   (0x0017) /* DMA channel 0 transfer select 23: USCIB1 transmit */
#define DMA0TSEL__ADC12IFG   (0x0018) /* DMA channel 0 transfer select 24: ADC12IFGx */
#define DMA0TSEL__DAC12_0IFG (0x0019) /* DMA channel 0 transfer select 25: DAC12_0IFG */
#define DMA0TSEL__DAC12_1IFG (0x001A) /* DMA channel 0 transfer select 26: DAC12_1IFG */
#define DMA0TSEL__USB_FNRXD  (0x001B) /* DMA channel 0 transfer select 27: USB FNRXD */
#define DMA0TSEL__USB_READY  (0x001C) /* DMA channel 0 transfer select 28: USB ready */
#define DMA0TSEL__MPY        (0x001D) /* DMA channel 0 transfer select 29: Multiplier ready */
#define DMA0TSEL__DMA5IFG    (0x001E) /* DMA channel 0 transfer select 30: previous DMA channel DMA5IFG */
#define DMA0TSEL__DMAE0      (0x001F) /* DMA channel 0 transfer select 31: ext. Trigger (DMAE0) */

#define DMA1TSEL__DMA_REQ    (0x0000)  /* DMA channel 1 transfer select 0:  DMA_REQ (sw) */
#define DMA1TSEL__TA0CCR0    (0x0100)  /* DMA channel 1 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA1TSEL__TA0CCR2    (0x0200)  /* DMA channel 1 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA1TSEL__TA1CCR0    (0x0300)  /* DMA channel 1 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA1TSEL__TA1CCR2    (0x0400)  /* DMA channel 1 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA1TSEL__TA2CCR0    (0x0500)  /* DMA channel 1 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA1TSEL__TA2CCR2    (0x0600)  /* DMA channel 1 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA1TSEL__TB0CCR0    (0x0700)  /* DMA channel 1 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA1TSEL__TB0CCR2    (0x0800)  /* DMA channel 1 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA1TSEL__RES9       (0x0900)  /* DMA channel 1 transfer select 9:  Reserved */
#define DMA1TSEL__RES10      (0x0A00) /* DMA channel 1 transfer select 10: Reserved */
#define DMA1TSEL__RES11      (0x0B00) /* DMA channel 1 transfer select 11: Reserved */
#define DMA1TSEL__USCIA2RX   (0x0C00) /* DMA channel 1 transfer select 12: USCIA2 receive */
#define DMA1TSEL__USCIA2TX   (0x0D00) /* DMA channel 1 transfer select 13: USCIA2 transmit */
#define DMA1TSEL__USCIB2RX   (0x0E00) /* DMA channel 1 transfer select 14: USCIB2 receive */
#define DMA1TSEL__USCIB2TX   (0x0F00) /* DMA channel 1 transfer select 15: USCIB2 transmit */
#define DMA1TSEL__USCIA0RX   (0x1000) /* DMA channel 1 transfer select 16: USCIA0 receive */
#define DMA1TSEL__USCIA0TX   (0x1100) /* DMA channel 1 transfer select 17: USCIA0 transmit */
#define DMA1TSEL__USCIB0RX   (0x1200) /* DMA channel 1 transfer select 18: USCIB0 receive */
#define DMA1TSEL__USCIB0TX   (0x1300) /* DMA channel 1 transfer select 19: USCIB0 transmit */
#define DMA1TSEL__USCIA1RX   (0x1400) /* DMA channel 1 transfer select 20: USCIA1 receive */
#define DMA1TSEL__USCIA1TX   (0x1500) /* DMA channel 1 transfer select 21: USCIA1 transmit */
#define DMA1TSEL__USCIB1RX   (0x1600) /* DMA channel 1 transfer select 22: USCIB1 receive */
#define DMA1TSEL__USCIB1TX   (0x1700) /* DMA channel 1 transfer select 23: USCIB1 transmit */
#define DMA1TSEL__ADC12IFG   (0x1800) /* DMA channel 1 transfer select 24: ADC12IFGx */
#define DMA1TSEL__DAC12_0IFG (0x1900) /* DMA channel 1 transfer select 25: DAC12_0IFG */
#define DMA1TSEL__DAC12_1IFG (0x1A00) /* DMA channel 1 transfer select 26: DAC12_1IFG */
#define DMA1TSEL__USB_FNRXD  (0x1B00) /* DMA channel 1 transfer select 27: USB FNRXD */
#define DMA1TSEL__USB_READY  (0x1C00) /* DMA channel 1 transfer select 28: USB ready */
#define DMA1TSEL__MPY        (0x1D00) /* DMA channel 1 transfer select 29: Multiplier ready */
#define DMA1TSEL__DMA0IFG    (0x1E00) /* DMA channel 1 transfer select 30: previous DMA channel DMA0IFG */
#define DMA1TSEL__DMAE0      (0x1F00) /* DMA channel 1 transfer select 31: ext. Trigger (DMAE0) */

#define DMA2TSEL__DMA_REQ    (0x0000)  /* DMA channel 2 transfer select 0:  DMA_REQ (sw) */
#define DMA2TSEL__TA0CCR0    (0x0001)  /* DMA channel 2 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA2TSEL__TA0CCR2    (0x0002)  /* DMA channel 2 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA2TSEL__TA1CCR0    (0x0003)  /* DMA channel 2 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA2TSEL__TA1CCR2    (0x0004)  /* DMA channel 2 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA2TSEL__TA2CCR0    (0x0005)  /* DMA channel 2 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA2TSEL__TA2CCR2    (0x0006)  /* DMA channel 2 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA2TSEL__TB0CCR0    (0x0007)  /* DMA channel 2 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA2TSEL__TB0CCR2    (0x0008)  /* DMA channel 2 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA2TSEL__RES9       (0x0009)  /* DMA channel 2 transfer select 9:  Reserved */
#define DMA2TSEL__RES10      (0x000A) /* DMA channel 2 transfer select 10: Reserved */
#define DMA2TSEL__RES11      (0x000B) /* DMA channel 2 transfer select 11: Reserved */
#define DMA2TSEL__USCIA2RX   (0x000C) /* DMA channel 2 transfer select 12: USCIA2 receive */
#define DMA2TSEL__USCIA2TX   (0x000D) /* DMA channel 2 transfer select 13: USCIA2 transmit */
#define DMA2TSEL__USCIB2RX   (0x000E) /* DMA channel 2 transfer select 14: USCIB2 receive */
#define DMA2TSEL__USCIB2TX   (0x000F) /* DMA channel 2 transfer select 15: USCIB2 transmit */
#define DMA2TSEL__USCIA0RX   (0x0010) /* DMA channel 2 transfer select 16: USCIA0 receive */
#define DMA2TSEL__USCIA0TX   (0x0011) /* DMA channel 2 transfer select 17: USCIA0 transmit */
#define DMA2TSEL__USCIB0RX   (0x0012) /* DMA channel 2 transfer select 18: USCIB0 receive */
#define DMA2TSEL__USCIB0TX   (0x0013) /* DMA channel 2 transfer select 19: USCIB0 transmit */
#define DMA2TSEL__USCIA1RX   (0x0014) /* DMA channel 2 transfer select 20: USCIA1 receive */
#define DMA2TSEL__USCIA1TX   (0x0015) /* DMA channel 2 transfer select 21: USCIA1 transmit */
#define DMA2TSEL__USCIB1RX   (0x0016) /* DMA channel 2 transfer select 22: USCIB1 receive */
#define DMA2TSEL__USCIB1TX   (0x0017) /* DMA channel 2 transfer select 23: USCIB1 transmit */
#define DMA2TSEL__ADC12IFG   (0x0018) /* DMA channel 2 transfer select 24: ADC12IFGx */
#define DMA2TSEL__DAC12_0IFG (0x0019) /* DMA channel 2 transfer select 25: DAC12_0IFG */
#define DMA2TSEL__DAC12_1IFG (0x001A) /* DMA channel 2 transfer select 26: DAC12_1IFG */
#define DMA2TSEL__USB_FNRXD  (0x001B) /* DMA channel 2 transfer select 27: USB FNRXD */
#define DMA2TSEL__USB_READY  (0x001C) /* DMA channel 2 transfer select 28: USB ready */
#define DMA2TSEL__MPY        (0x001D) /* DMA channel 2 transfer select 29: Multiplier ready */
#define DMA2TSEL__DMA1IFG    (0x001E) /* DMA channel 2 transfer select 30: previous DMA channel DMA1IFG */
#define DMA2TSEL__DMAE0      (0x001F) /* DMA channel 2 transfer select 31: ext. Trigger (DMAE0) */

#define DMA3TSEL__DMA_REQ    (0x0000)  /* DMA channel 3 transfer select 0:  DMA_REQ (sw) */
#define DMA3TSEL__TA0CCR0    (0x0100)  /* DMA channel 3 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA3TSEL__TA0CCR2    (0x0200)  /* DMA channel 3 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA3TSEL__TA1CCR0    (0x0300)  /* DMA channel 3 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA3TSEL__TA1CCR2    (0x0400)  /* DMA channel 3 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA3TSEL__TA2CCR0    (0x0500)  /* DMA channel 3 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA3TSEL__TA2CCR2    (0x0600)  /* DMA channel 3 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA3TSEL__TB0CCR0    (0x0700)  /* DMA channel 3 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA3TSEL__TB0CCR2    (0x0800)  /* DMA channel 3 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA3TSEL__RES9       (0x0900)  /* DMA channel 3 transfer select 9:  Reserved */
#define DMA3TSEL__RES10      (0x0A00) /* DMA channel 3 transfer select 10: Reserved */
#define DMA3TSEL__RES11      (0x0B00) /* DMA channel 3 transfer select 11: Reserved */
#define DMA3TSEL__USCIA2RX   (0x0C00) /* DMA channel 3 transfer select 12: USCIA2 receive */
#define DMA3TSEL__USCIA2TX   (0x0D00) /* DMA channel 3 transfer select 13: USCIA2 transmit */
#define DMA3TSEL__USCIB2RX   (0x0E00) /* DMA channel 3 transfer select 14: USCIB2 receive */
#define DMA3TSEL__USCIB2TX   (0x0F00) /* DMA channel 3 transfer select 15: USCIB2 transmit */
#define DMA3TSEL__USCIA0RX   (0x1000) /* DMA channel 3 transfer select 16: USCIA0 receive */
#define DMA3TSEL__USCIA0TX   (0x1100) /* DMA channel 3 transfer select 17: USCIA0 transmit */
#define DMA3TSEL__USCIB0RX   (0x1200) /* DMA channel 3 transfer select 18: USCIB0 receive */
#define DMA3TSEL__USCIB0TX   (0x1300) /* DMA channel 3 transfer select 19: USCIB0 transmit */
#define DMA3TSEL__USCIA1RX   (0x1400) /* DMA channel 3 transfer select 20: USCIA1 receive */
#define DMA3TSEL__USCIA1TX   (0x1500) /* DMA channel 3 transfer select 21: USCIA1 transmit */
#define DMA3TSEL__USCIB1RX   (0x1600) /* DMA channel 3 transfer select 22: USCIB1 receive */
#define DMA3TSEL__USCIB1TX   (0x1700) /* DMA channel 3 transfer select 23: USCIB1 transmit */
#define DMA3TSEL__ADC12IFG   (0x1800) /* DMA channel 3 transfer select 24: ADC12IFGx */
#define DMA3TSEL__DAC12_0IFG (0x1900) /* DMA channel 3 transfer select 25: DAC12_0IFG */
#define DMA3TSEL__DAC12_1IFG (0x1A00) /* DMA channel 3 transfer select 26: DAC12_1IFG */
#define DMA3TSEL__USB_FNRXD  (0x1B00) /* DMA channel 3 transfer select 27: USB FNRXD */
#define DMA3TSEL__USB_READY  (0x1C00) /* DMA channel 3 transfer select 28: USB ready */
#define DMA3TSEL__MPY        (0x1D00) /* DMA channel 3 transfer select 29: Multiplier ready */
#define DMA3TSEL__DMA2IFG    (0x1E00) /* DMA channel 3 transfer select 30: previous DMA channel DMA2IFG */
#define DMA3TSEL__DMAE0      (0x1F00) /* DMA channel 3 transfer select 31: ext. Trigger (DMAE0) */

#define DMA4TSEL__DMA_REQ    (0x0000)  /* DMA channel 4 transfer select 0:  DMA_REQ (sw) */
#define DMA4TSEL__TA0CCR0    (0x0001)  /* DMA channel 4 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA4TSEL__TA0CCR2    (0x0002)  /* DMA channel 4 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA4TSEL__TA1CCR0    (0x0003)  /* DMA channel 4 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA4TSEL__TA1CCR2    (0x0004)  /* DMA channel 4 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA4TSEL__TA2CCR0    (0x0005)  /* DMA channel 4 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA4TSEL__TA2CCR2    (0x0006)  /* DMA channel 4 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA4TSEL__TB0CCR0    (0x0007)  /* DMA channel 4 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA4TSEL__TB0CCR2    (0x0008)  /* DMA channel 4 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA4TSEL__RES9       (0x0009)  /* DMA channel 4 transfer select 9:  Reserved */
#define DMA4TSEL__RES10      (0x000A) /* DMA channel 4 transfer select 10: Reserved */
#define DMA4TSEL__RES11      (0x000B) /* DMA channel 4 transfer select 11: Reserved */
#define DMA4TSEL__USCIA2RX   (0x000C) /* DMA channel 4 transfer select 12: USCIA2 receive */
#define DMA4TSEL__USCIA2TX   (0x000D) /* DMA channel 4 transfer select 13: USCIA2 transmit */
#define DMA4TSEL__USCIB2RX   (0x000E) /* DMA channel 4 transfer select 14: USCIB2 receive */
#define DMA4TSEL__USCIB2TX   (0x000F) /* DMA channel 4 transfer select 15: USCIB2 transmit */
#define DMA4TSEL__USCIA0RX   (0x0010) /* DMA channel 4 transfer select 16: USCIA0 receive */
#define DMA4TSEL__USCIA0TX   (0x0011) /* DMA channel 4 transfer select 17: USCIA0 transmit */
#define DMA4TSEL__USCIB0RX   (0x0012) /* DMA channel 4 transfer select 18: USCIB0 receive */
#define DMA4TSEL__USCIB0TX   (0x0013) /* DMA channel 4 transfer select 19: USCIB0 transmit */
#define DMA4TSEL__USCIA1RX   (0x0014) /* DMA channel 4 transfer select 20: USCIA1 receive */
#define DMA4TSEL__USCIA1TX   (0x0015) /* DMA channel 4 transfer select 21: USCIA1 transmit */
#define DMA4TSEL__USCIB1RX   (0x0016) /* DMA channel 4 transfer select 22: USCIB1 receive */
#define DMA4TSEL__USCIB1TX   (0x0017) /* DMA channel 4 transfer select 23: USCIB1 transmit */
#define DMA4TSEL__ADC12IFG   (0x0018) /* DMA channel 4 transfer select 24: ADC12IFGx */
#define DMA4TSEL__DAC12_0IFG (0x0019) /* DMA channel 4 transfer select 25: DAC12_0IFG */
#define DMA4TSEL__DAC12_1IFG (0x001A) /* DMA channel 4 transfer select 26: DAC12_1IFG */
#define DMA4TSEL__USB_FNRXD  (0x001B) /* DMA channel 4 transfer select 27: USB FNRXD */
#define DMA4TSEL__USB_READY  (0x001C) /* DMA channel 4 transfer select 28: USB ready */
#define DMA4TSEL__MPY        (0x001D) /* DMA channel 4 transfer select 29: Multiplier ready */
#define DMA4TSEL__DMA3IFG    (0x001E) /* DMA channel 4 transfer select 30: previous DMA channel DMA3IFG */
#define DMA4TSEL__DMAE0      (0x001F) /* DMA channel 4 transfer select 31: ext. Trigger (DMAE0) */

#define DMA5TSEL__DMA_REQ    (0x0000)  /* DMA channel 5 transfer select 0:  DMA_REQ (sw) */
#define DMA5TSEL__TA0CCR0    (0x0100)  /* DMA channel 5 transfer select 1:  Timer0_A (TA0CCR0.IFG) */
#define DMA5TSEL__TA0CCR2    (0x0200)  /* DMA channel 5 transfer select 2:  Timer0_A (TA0CCR2.IFG) */
#define DMA5TSEL__TA1CCR0    (0x0300)  /* DMA channel 5 transfer select 3:  Timer1_A (TA1CCR0.IFG) */
#define DMA5TSEL__TA1CCR2    (0x0400)  /* DMA channel 5 transfer select 4:  Timer1_A (TA1CCR2.IFG) */
#define DMA5TSEL__TA2CCR0    (0x0500)  /* DMA channel 5 transfer select 5:  Timer2_A (TA2CCR0.IFG) */
#define DMA5TSEL__TA2CCR2    (0x0600)  /* DMA channel 5 transfer select 6:  Timer2_A (TA2CCR2.IFG) */
#define DMA5TSEL__TB0CCR0    (0x0700)  /* DMA channel 5 transfer select 7:  TimerB0 (TB0CCR0.IFG) */
#define DMA5TSEL__TB0CCR2    (0x0800)  /* DMA channel 5 transfer select 8:  TimerB0 (TB0CCR2.IFG) */
#define DMA5TSEL__RES9       (0x0900)  /* DMA channel 5 transfer select 9:  Reserved */
#define DMA5TSEL__RES10      (0x0A00) /* DMA channel 5 transfer select 10: Reserved */
#define DMA5TSEL__RES11      (0x0B00) /* DMA channel 5 transfer select 11: Reserved */
#define DMA5TSEL__USCIA2RX   (0x0C00) /* DMA channel 5 transfer select 12: USCIA2 receive */
#define DMA5TSEL__USCIA2TX   (0x0D00) /* DMA channel 5 transfer select 13: USCIA2 transmit */
#define DMA5TSEL__USCIB2RX   (0x0E00) /* DMA channel 5 transfer select 14: USCIB2 receive */
#define DMA5TSEL__USCIB2TX   (0x0F00) /* DMA channel 5 transfer select 15: USCIB2 transmit */
#define DMA5TSEL__USCIA0RX   (0x1000) /* DMA channel 5 transfer select 16: USCIA0 receive */
#define DMA5TSEL__USCIA0TX   (0x1100) /* DMA channel 5 transfer select 17: USCIA0 transmit */
#define DMA5TSEL__USCIB0RX   (0x1200) /* DMA channel 5 transfer select 18: USCIB0 receive */
#define DMA5TSEL__USCIB0TX   (0x1300) /* DMA channel 5 transfer select 19: USCIB0 transmit */
#define DMA5TSEL__USCIA1RX   (0x1400) /* DMA channel 5 transfer select 20: USCIA1 receive */
#define DMA5TSEL__USCIA1TX   (0x1500) /* DMA channel 5 transfer select 21: USCIA1 transmit */
#define DMA5TSEL__USCIB1RX   (0x1600) /* DMA channel 5 transfer select 22: USCIB1 receive */
#define DMA5TSEL__USCIB1TX   (0x1700) /* DMA channel 5 transfer select 23: USCIB1 transmit */
#define DMA5TSEL__ADC12IFG   (0x1800) /* DMA channel 5 transfer select 24: ADC12IFGx */
#define DMA5TSEL__DAC12_0IFG (0x1900) /* DMA channel 5 transfer select 25: DAC12_0IFG */
#define DMA5TSEL__DAC12_1IFG (0x1A00) /* DMA channel 5 transfer select 26: DAC12_1IFG */
#define DMA5TSEL__USB_FNRXD  (0x1B00) /* DMA channel 5 transfer select 27: USB FNRXD */
#define DMA5TSEL__USB_READY  (0x1C00) /* DMA channel 5 transfer select 28: USB ready */
#define DMA5TSEL__MPY        (0x1D00) /* DMA channel 5 transfer select 29: Multiplier ready */
#define DMA5TSEL__DMA4IFG    (0x1E00) /* DMA channel 5 transfer select 30: previous DMA channel DMA4IFG */
#define DMA5TSEL__DMAE0      (0x1F00) /* DMA channel 5 transfer select 31: ext. Trigger (DMAE0) */



/************************************************************
* MID
************************************************************/
#define __MSP430_HAS_MID__          /* Definition to show that Module is available */
#define MID_BASE __MSP430_BASEADDRESS_MID__

#ifndef _MID_H_
#define _MID_H_

#define _MidStart           0x6C00
#define MID_FIRMWARE_V1_0   0x28438000
#define CSECKEY             (0x584B)      // Error Cache Config PW

