ciaa/firmware_v1/externals/drivers/msp430/inc/msp430f5659.h
#ifdef __STDC__
typedef void* mid_func_ptr ;

//*******************************************
//* MID Functions
//*******************************************

// Enable MID protection
typedef void              (**_tMidEnable)       (unsigned short CW0, unsigned short CW1);
#define _MidEnable        (*(_tMidEnable)       (_MidStart+4))

// Disable MID protection
typedef void              (**_tMidDisable)      (void);
#define _MidDisable       (*(_tMidDisable)      (_MidStart+8))

// Get back the Error Address
typedef unsigned short*   (**_tMidGetErrAdr)  (void);
#define _MidGetErrAdr     (*(_tMidGetErrAdr)  (_MidStart+12))

// Check Memory for Errors and return first error
typedef unsigned short*   (**_tMidCheckMem)     (mid_func_ptr startAdr, mid_func_ptr endAdr);
#define _MidCheckMem      (*(_tMidCheckMem)     (_MidStart+16))

// Writes raw flash data
typedef void              (**_tMidSetRaw)       (unsigned short data, unsigned short parity,\
                                                 mid_func_ptr* dest, unsigned short FlashKey);
#define _MidSetRaw        (*(_tMidSetRaw)       (_MidStart+20))

// Reads flash parity information
typedef unsigned short    (**_tMidGetParity)    (mid_func_ptr* src);
#define _MidGetParity     (*(_tMidGetParity)    (_MidStart+24))

// Calculate the VParity
typedef unsigned short    (**_tMidCalcVParity)  (mid_func_ptr startAdr, mid_func_ptr endAdr);
#define _MidCalcVParity     (*(_tMidCalcVParity)    (_MidStart+28))


//*******************************************
//* Macros
//*******************************************

#define MidEnable(a,b)        _MidEnable      (a,b)
#define MidDisable()          _MidDisable     ()
#define MidGetErrAdr()        _MidGetErrAdr   ()
#define MidCheckMem(a,b)      _MidCheckMem    ((mid_func_ptr)a,(mid_func_ptr)b)
#define MidSetRaw(a,b,c,d)    _MidSetRaw      (a,b,(mid_func_ptr)c,d)
#define MidGetParity(a)       _MidGetParity   ((mid_func_ptr)a)
#define MidCalcVParity(a,b)   _MidCalcVParity ((mid_func_ptr)a,(mid_func_ptr)b)

#else

// Assembler defines

#define MidFWID         _MidStart+0
#define MidFWRev        _MidStart+2
#define MidEnable       _MidStart+4
#define MidDisable      _MidStart+8
#define MidGetErrAdr    _MidStart+12
#define MidCheckMem     _MidStart+16
#define MidSetRaw       _MidStart+20
#define MidGetParity    _MidStart+24
#define MidCalcVParity  _MidStart+28
#endif


#endif //_MID_H_
/*************************************************************
* Flash Memory
*************************************************************/
#define __MSP430_HAS_FLASH__         /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_FLASH__ 0x0140
#define FLASH_BASE __MSP430_BASEADDRESS_FLASH__

#define FCTL1_                0x0140    /* FLASH Control 1 */
sfrb(FCTL1_L , FCTL1_);
sfrb(FCTL1_H , FCTL1_+1);
sfrw(FCTL1, FCTL1_);
//sfrbw    FCTL2                  (0x0142)  /* FLASH Control 2 */
#define FCTL3_                0x0144    /* FLASH Control 3 */
sfrb(FCTL3_L , FCTL3_);
sfrb(FCTL3_H , FCTL3_+1);
sfrw(FCTL3, FCTL3_);
#define FCTL4_                0x0146    /* FLASH Control 4 */
sfrb(FCTL4_L , FCTL4_);
sfrb(FCTL4_H , FCTL4_+1);
sfrw(FCTL4, FCTL4_);

#define FRPW                (0x9600)  /* Flash password returned by read */
#define FWPW                (0xA500)  /* Flash password for write */
#define FXPW                (0x3300)  /* for use with XOR instruction */
#define FRKEY               (0x9600)  /* (legacy definition) Flash key returned by read */
#define FWKEY               (0xA500)  /* (legacy definition) Flash key for write */
#define FXKEY               (0x3300)  /* (legacy definition) for use with XOR instruction */

/* FCTL1 Control Bits */
//#define RESERVED            (0x0001)  /* Reserved */
#define ERASE               (0x0002)  /* Enable bit for Flash segment erase */
#define MERAS               (0x0004)  /* Enable bit for Flash mass erase */
//#define RESERVED            (0x0008)  /* Reserved */
//#define RESERVED            (0x0010)  /* Reserved */
#define SWRT                (0x0020)  /* Smart Write enable */
#define WRT                 (0x0040)  /* Enable bit for Flash write */
#define BLKWRT              (0x0080)  /* Enable bit for Flash segment write */

/* FCTL1 Control Bits */
//#define RESERVED            (0x0001)  /* Reserved */
#define ERASE_L             (0x0002)  /* Enable bit for Flash segment erase */
#define MERAS_L             (0x0004)  /* Enable bit for Flash mass erase */
//#define RESERVED            (0x0008)  /* Reserved */
//#define RESERVED            (0x0010)  /* Reserved */
#define SWRT_L              (0x0020)  /* Smart Write enable */
#define WRT_L               (0x0040)  /* Enable bit for Flash write */
#define BLKWRT_L            (0x0080)  /* Enable bit for Flash segment write */


/* FCTL3 Control Bits */
#define BUSY                (0x0001)  /* Flash busy: 1 */
#define KEYV                (0x0002)  /* Flash Key violation flag */
#define ACCVIFG             (0x0004)  /* Flash Access violation flag */
#define WAIT                (0x0008)  /* Wait flag for segment write */
#define LOCK                (0x0010)  /* Lock bit: 1 - Flash is locked (read only) */
#define EMEX                (0x0020)  /* Flash Emergency Exit */
#define LOCKA               (0x0040)  /* Segment A Lock bit: read = 1 - Segment is locked (read only) */
//#define RESERVED            (0x0080)  /* Reserved */

/* FCTL3 Control Bits */
#define BUSY_L              (0x0001)  /* Flash busy: 1 */
#define KEYV_L              (0x0002)  /* Flash Key violation flag */
#define ACCVIFG_L           (0x0004)  /* Flash Access violation flag */
#define WAIT_L              (0x0008)  /* Wait flag for segment write */
#define LOCK_L              (0x0010)  /* Lock bit: 1 - Flash is locked (read only) */
#define EMEX_L              (0x0020)  /* Flash Emergency Exit */
#define LOCKA_L             (0x0040)  /* Segment A Lock bit: read = 1 - Segment is locked (read only) */
//#define RESERVED            (0x0080)  /* Reserved */


/* FCTL4 Control Bits */
#define VPE                 (0x0001)  /* Voltage Changed during Program Error Flag */
#define MGR0                (0x0010)  /* Marginal read 0 mode. */
#define MGR1                (0x0020)  /* Marginal read 1 mode. */
#define LOCKINFO            (0x0080)  /* Lock INFO Memory bit: read = 1 - Segment is locked (read only) */

/* FCTL4 Control Bits */
#define VPE_L               (0x0001)  /* Voltage Changed during Program Error Flag */
#define MGR0_L              (0x0010)  /* Marginal read 0 mode. */
#define MGR1_L              (0x0020)  /* Marginal read 1 mode. */
#define LOCKINFO_L          (0x0080)  /* Lock INFO Memory bit: read = 1 - Segment is locked (read only) */


/************************************************************
* HARDWARE MULTIPLIER 32Bit
************************************************************/
#define __MSP430_HAS_MPY32__          /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_MPY32__ 0x04C0
#define MPY32_BASE __MSP430_BASEADDRESS_MPY32__

